In [59]:
import pandas as pd

airlines = pd.read_csv('krk-airlines.csv')
flights = pd.read_csv('krk-flights.csv')
passengers = pd.read_csv('krk-passengers.csv')

The files krk-airlines.csv, krk-flights.csv and krk-passengers.csv contain data about flights from Krakow Airport. Calculate and display:

List including flight number and destination (two columns)

In [60]:
flights.loc[:,['flight', 'to']]

  flight        to
0  LN222    London
1  BE321    Berlin
2  PA006     Paris
3  NY777  New York

Flight list with the full name of the airline and the name of the aircraft

In [61]:
airlines.loc[:,['airline', 'airplane']]

      airline     airplane
0   PanEurope   Boeing 787
1  SunHoliday  Airbus A319
2     BlueSky  Airbus A330

A list of passengers on a flight to London sorted by surname

In [62]:
flights_passengers = pd.merge(flights, passengers, on='flight')

flights_passengers.query("to == 'London'").loc[:,['surname', 'name']].sort_values('surname')

       surname      name
14       Braid   Claudie
1      Budcock  Nehemiah
13     Cockman    Ingmar
3      Matlock    Willyt
6   McComiskey    Rennie
0        Osban  Ferguson
4       Pattie    Nolana
8       Peplay    Mareah
5      Permain    Araldo
7        Quare    Stormy
9      Smieton      Edik
2        Snoad     Lindi
12      Tickel  Emmanuel
11    Tregunna    Ashton
10        Vear  Brewster

A list of women flying to Paris ordered by surname

In [63]:
flights_passengers.query("gender == 'Female' and to == 'Paris'").loc[:,['surname', 'name']] \
.sort_values('surname')

       surname       name
37      Benzie    Miguela
33  Butterfill      Heath
61     Earland    Erminie
70       Elger     Janene
50        Emig      Alene
42       Evins    Chelsae
51    Fennessy      Fanny
65   Freeborne      Paige
68    Garlicke    Genevra
60      Kupper      Linda
39      Letson  Annemarie
63     Mapston        Lia
32     McGrann      Korry
49     Milesap     Ivette
47   Pinkerton      Leann
40    Salzberg       Cloe
69   Scutching     Prisca
46     Sumpton        Kip
54        Tink     Blanch
56      Yendle      Talia

Number of passengers on the flight to Berlin

In [64]:
flights_passengers.query("to == 'Berlin'").loc[:,['surname']].count()

surname    17
dtype: int64

Number of men flying from Krakow

In [65]:
flights_passengers.rename(columns={'from':'fr'}) \
.query("gender == 'Male' and fr == 'Krakow'").loc[:,['surname']] \
.count()

surname    54
dtype: int64

Number of passengers for each flight

In [66]:
flights_passengers.loc[:,['flight', 'surname']].groupby('flight').count() \
.rename(columns={'surname':'number'})

        number
flight
BE321       17
LN222       15
NY777       27
PA006       41